Revit 2027 API
ScheduleDefinition.GetSortGroupFieldCount Method
 Gets the number of sorting/grouping fields in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSortGroupFieldCount()
Public Function GetSortGroupFieldCount As Integer
public:
int GetSortGroupFieldCount()
member GetSortGroupFieldCount : unit -> int
Return Value
Int32
 The number of sorting/grouping fields.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace